Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: When you define a function, you can optionally define one or more named, typed values that the function takes as input, known as parameters.
ja: あなたがある関数を定義するとき、あなたは随意にその関数が入力としてとる、１つ以上の名前をつけられ型付けされた値、パラメータとして知られるものを定義できます。

source: When you define a protocol extension, you can specify constraints that conforming types must satisfy before the methods and properties of the extension are available.
ja: あなたがプロトコル拡張を定義するとき、あなたは準拠している型がその拡張のメソッドやプロパティが利用可能になる前に満たさなければならない制約を指定することができます。

source: When you define your own custom structures and classes, it’s your responsibility to decide what qualifies as two instances being equal.
ja: あなたが独自のあつらえのクラスと構造体を定義するとき、２つのインスタンスが等しくなる基準は何かを決めるのはあなたの責任です。

source: When you define your own structures, classes, and enumerations, it can be useful to provide your own implementations of the standard Swift operators for these custom types.
ja: あなたがあなた自身の構造体、クラス、そして列挙を定義するとき、標準のスウィフト演算子のあなた自身の実施をそれらあつらえの型のために提供することは役に立つことがありえます。

source: When you develop a framework, mark the public-facing interface to that framework as open or public so that it can be viewed and accessed by other modules, such as an app that imports the framework.
ja: あなたがフレームワークを開発する場合、そのフレームワークを開放または公開するために公開向けインタフェースとして印してください、それで、他のモジュール、例えばそのフレームワークをインポートするアプリによってそれが見られてアクセスされることができます。

source: When you do so, you must mark the overridden subscript declaration with the override declaration modifier.
ja: あなたがそうするとき、あなたはオーバーライドされる添え字宣言をoverride宣言修飾子で印しなければなりません。

source: When you don’t, Swift automatically assigns the values for you.
ja: あなたがそうしない時は、スウィフトはあなたの代わりに自動的に値を割り当てます。

source: When you extend a generic type, you don’t provide a type parameter list as part of the extension’s definition.
ja: あなたがある総称体型を拡張する時、あなたは型パラメーターリストを拡張の定義の一部として提供しません。

source: When you get a substring from a string—for example, using a subscript or a method like prefix(_:)—the result is an instance of Substring [https://developer.apple.com/documentation/swift/substring], not another string.
ja: あなたがある文字列から下位文字列を得る場合 — 例えば、添え字またはprefix(_:)のようなメソッドを使って — その結果はSubstring [https://developer.apple.com/documentation/swift/substring]のインスタンスとなります、別の文字列ではなく。

source: When you include property wrapper arguments, you can also specify an initial value using assignment.
ja: あなたがプロパティラッパー引数を含める場合、あなたはまた代入を使って初期値を指定できます。

source: When you make a copy of stepSize before calling increment(_:), it’s clear that the value of copyOfStepSize is incremented by the current step size.
ja: あなたがstepSizeのコピーをincrement(_:)を呼び出す前に作る場合、それはcopyOfStepSizeの値が現在の段階量だけ漸増されることを明確にします。

source: When you mark a member declaration with the dynamic modifier, access to that member is always dynamically dispatched using the Objective-C runtime.
ja: あなたがメンバー宣言をdynamic修飾子で印する時は、そのメンバーへのアクセスは、常に動的にObjective-Cランタイムを使用してディスパッチされます。

source: When you provide a method, property, or subscript override for a subclass, it is sometimes useful to use the existing superclass implementation as part of your override.
ja: あなたがサブクラスのためにメソッド、プロパティ、または添え字のオーバーライドを提供する時、既存のスーパークラスの実装をあなたのオーバーライドの一部として使うことは時々役に立ちます。

source: When you specify an initial value for the property, Swift uses the init(wrappedValue:) initializer to set up the wrapper.
ja: あなたが初期値をプロパティに対して指定する場合、スウィフトはinit(wrappedValue:)イニシャライザを使ってラッパーを準備します。

source: When you use Xcode 11.4 to build Swift 4 and Swift 4.2 code, most Swift 5.2 functionality is available.
ja: あなたがXcode 11.4を使ってSwift 4とSwift 4.2コードをビルドする場合、ほとんどのSwift 5.2機能性が利用可能です。

source: When you use a key-path string expression within a class, you can refer to a property of that class by writing just the property name, without the class name.
ja: あなたがキーパス文字列式をあるクラス内で使う時、あなたはそのクラスのプロパティを参照することが、クラス名なしで単にそのプロパティ名を書くことによって可能です。

source: When you use a method or property in an optional requirement, its type automatically becomes an optional.
ja: あなたがオプショナルの要件の中のメソッドやプロパティを使うとき、それの型は自動的にオプショナルになります。

source: When you use a property wrapper, you write the management code once when you define the wrapper, and then reuse that management code by applying it to multiple properties.
ja: あなたがプロパティラッパーを使う場合、あなたは管理コードを一度だけあなたがラッパーを定義する時に書きます、そしてそれからその管理コードを、それを複数のプロパティに適用することによって再利用します。

source: When you use an implicitly unwrapped optional value, Swift first tries to use it as an ordinary optional value; if it can’t be used as an optional, Swift force-unwraps the value.
ja: あなたがある暗黙的にアンラップされるオプショナル値を使う場合、Swiftはまずそれを普通のオプショナル値として使おうと試みます；それがオプショナルとして使用できないならば、Swiftは値を強制アンラップします。

source: When you use subscript syntax, the index you specify needs to be valid.
ja: あなたが添え字構文を使う時、あなたが指定するインデックスは有効である必要があります。

source: When you use the trailing closure syntax, you don’t write the argument label for the closure as part of the function call.
ja: あなたが後付クロージャ構文を使うとき、あなたは引数ラベルをそのクロージャに対して関数呼び出しの一部として書きません。

source: When you work with values whose type is a protocol type, methods outside the protocol definition are not available.
ja: その型があるプロトコル型である値をあなたが扱うとき、そのプロトコル定義の外部のメソッドは利用できません。

source: When you write = 1 on a property with a wrapper, that’s translated into a call to the init(wrappedValue:) initializer.
ja: あなたが= 1をラッパーをもつプロパティ上で記述する場合、それはinit(wrappedValue:)イニシャライザへの呼び出しに変換されます。

source: When you write a simple single-target app, the code in your app is typically self-contained within the app and doesn’t need to be made available outside of the app’s module.
ja: あなたが単純な単一ターゲットアプリを書いている場合、あなたのアプリのコードは概してそのアプリの内部に自身で持っていて、そしてそのアプリのモジュールの外側で利用可能にされることは必要ありません。

source: When you write a subclass initializer that matches a superclass designated initializer, you are effectively providing an override of that designated initializer.
ja: あなたがスーパークラスの指定イニシャライザと一致するあるサブクラス・イニシャライザを書く時、あなたは事実上その指定イニシャライザのオーバーライドを提供しています。

source: When you write an app with a unit test target, the code in your app needs to be made available to that module in order to be tested.
ja: あなたがユニットテストターゲットを使ってアプリを書く場合、あなたのアプリのコードはテストされるためにそのモジュールに対して利用可能にされる必要があります。

source: When you write arguments in parentheses after the custom attribute, Swift uses the initializer that accepts those arguments to set up the wrapper.
ja: あなたが引数を丸括弧の中であつらえの属性の後に書く場合、スウィフトはそれらの引数を受け入れるイニシャライザを使ってそのラッパーを準備します。

source: When you write or extend a type to conform to a protocol, you must ensure that the type’s implementation of each protocol requirement has at least the same access level as the type’s conformance to that protocol.
ja: あなたがある型をプロトコルに準拠するように書く、または拡張する時は、あなたはその型のもつ各プロトコル要件の実装が少なくともそのプロトコルに対するその型の準拠と同じアクセス水準を持つことを確かにしてください。

source: When you write the name of a generic superclass class after the colon, you must include the full name of that generic class, including its generic parameter clause.
ja: あなたがコロンの後に総称体スーパークラスの名前を書く時、あなたはその総称体クラスの名前全体を、それの総称体パラメーター節を含めて書く必要があります。

source: When your source code includes a line break inside of a multiline string literal, that line break also appears in the string’s value.
ja: あなたのソースコードがある複数行文字列リテラルの内部に改行を含む場合、その改行はまたその文字列の持つ値の中に現れます。

source: When you’re ready to store the result for a longer time, you convert the substring to an instance of String.
ja: あなたが結果を長期間にわたって格納しようとする場合、あなたは下位文字列をStringのインスタンスへと変換します。

source: When you’re working with enumerations that store integer or string raw values, you don’t have to explicitly assign a raw value for each case.
ja: あなたが整数や文字列の生の値を格納する列挙を使って作業している時、あなたは各ケース節に生の値を明示的に割り当てる必要はありません。

source: Whenever a new Chessboard instance is created, the closure is executed, and the default value of boardColors is calculated and returned.
ja: 新しいChessboardインスタンスがつくられるときはいつでも、このクロージャは実行されます、そしてboardColorsの省略時の値が計算されて、返されます。

source: Whenever a new instance of the type that the property belongs to is initialized, the closure or function is called, and its return value is assigned as the property’s default value.
ja: そのプロパティが属している型の新しいインスタンスが初期化されるときはいつでも、そのクロージャまたは関数が呼ばれます、そしてその戻り値はプロパティの省略時の値として代入されます。

source: Whenever an object in the array conforms to the HasArea protocol, the optional value returned by the as? operator is unwrapped with optional binding into a constant called objectWithArea.
ja: 配列のオブジェクトがHasAreaプロトコルに準拠するときはいつでも、as?演算子によって返されるオプショナルの値は、オプショナル束縛によってobjectWithAreaと呼ばれる定数へとアンラップされます。

source: Whenever this return value equals 7, the dice roll has become too large and is reset to a value of 1.
ja: この戻り値が7に等しいときはいつでも、そのさいころの目は大きくなり過ぎているので、値1へ設定し直されます。

source: Whenever you assign a function or a closure to a constant or a variable, you are actually setting that constant or variable to be a reference to the function or closure.
ja: あなたが関数やクロージャを定数または変数に代入するときはいつでも、あなたは実際はその定数または変数が関数やクロージャへの参照であると設定しています。

source: Whenever you define a new structure or class, you define a new Swift type.
ja: あなたが新しいクラスまたは構造体を定義するときはいつでも、あなたはある新しいスウィフト型を定義します。

source: Whenever you set the currentSpeed property of an AutomaticCar instance, the property’s didSet observer sets the instance’s gear property to an appropriate choice of gear for the new speed.
ja: あなたがAutomaticCarインスタンスのcurrentSpeedプロパティを設定したときはいつでも、そのプロパティのdidSetオブザーバーは、そのインスタンスのgearプロパティを新しい速度のために適切な選択に設定します。

source: Where this is appropriate, you access the superclass version of a method, property, or subscript by using the super prefix:
ja: これがふさわしい所で、あなたはsuper接頭辞を使用することによってスーパークラス版のメソッド、プロパティ、または添え字にアクセスします：

source: Where you believe this is the case, you can try to downcast to the subclass type with a type cast operator (as? or as!).
ja: あなたがこの場合であると思う所で、あなたはサブクラス型へのダウンキャストを試みることが型キャスト演算子（as?またはas!）を使ってできます。

source: Wherever you use tenEighty, you also have to think about the code that uses alsoTenEighty, and vice versa.
ja: あなたがtenEightyを使うどこであれ、あなたはまたalsoTenEightyを使うコードについて頭を働かせなければなりません、そして逆もまた同様に。

source: While
ja: 最初に評価

source: While Loops
ja: whileループ

source: While Statement
ja: while文

source: While it is most common for a subscript to take a single parameter, you can also define a subscript with multiple parameters if it is appropriate for your type.
ja: 添え字がただ１つのパラメータをとることが最も普通であるけれども、あなたはまた、それがあなたの型に適切ならば、複数のパラメータをもつ添え字を定義することができます。

source: While you’re adding items to the budget, it’s in a temporary, invalid state because the total amount hasn’t been updated to reflect the newly added items.
ja: あなたが項目を予算案に加えている間、それは一時的な、無効な状態にあります、なぜなら総支出額は新しく追加された項目を反映するよう更新されていないからです。

source: Whitespace and Comments
ja: 空白とコメント

source: Whitespace has two uses: to separate tokens in the source file and to help determine whether an operator is a prefix or postfix (see Operators), but is otherwise ignored.
ja: 空白には、２つの用途があります：ソース・ファイルの中のトークンを切り離すため、そして、演算子が接頭辞か接尾辞であるかについて決定することを手伝います（演算子を見てください）、それ以外では無視されます。

source: Wildcard Expression
ja: ワイルドカード式

source: Wildcard Pattern
ja: ワイルドカード・パターン

source: With a conditional statement, you can use a statement label with the break statement to end the execution of the labeled statement.
ja: 条件文では、あなたは文ラベルをbreak文とともに使うことで、ラベルをつけられた文の実行を終えることができます。

source: With a few exceptions, a function of any calling convention can be used when a function any other calling convention is needed.
ja: 2、3の例外がありますが、何らかの呼出規約の関数は、何らかの他の呼出規約の関数が必要とされる場合に使用可能です。

source: With a loop statement, you can use a statement label with the break or continue statement to end or continue the execution of the labeled statement.
ja: ループ文では、あなたは文ラベルをbreakまたはcontinue文とともに使うことで、ラベルをつけられた文の実行を終えたり継続したりすることができます。

source: With an optional tuple type, the entire tuple is optional, not just each individual value within the tuple.
ja: オプショナルタプル型では、タプル全体がオプショナルです、単にタプルの内部の個々の値それぞれではありません。

source: With the exception of the implicit unwrapping behavior, the following two declarations are equivalent:
ja: 暗黙的にアンラップされる挙動を除けば、以下の２つの宣言は等しいです：

source: With those settings, the following code prints all three messages:
ja: それらの設定で、以下のコードは３つのメッセージすべてを出力します：

source: Within a function, don’t access a value that was passed as an in-out argument, even if the original value is available in the current scope.
ja: 関数内部で、in-out引数として渡された値にアクセスしないでください、たとえその元の値が現在のスコープにおいて利用可能であるとしてもです。

source: Within the body of a type method, the implicit self property refers to the type itself, rather than an instance of that type.
ja: ある型メソッドの本文内で、暗黙のselfプロパティはその型自身に言及します、その型のインスタンスではありません。

source: Within the method, both self and teammate refer to the same location in memory—as shown in the figure below.
ja: メソッド内部で、selfおよびteammateの両方がメモリ中の同じ位置を参照します — 下の図で示すように。

source: Without the self prefix, Swift would assume that both uses of x referred to the method parameter called x.
ja: self接頭辞なしでは、スウィフトは両方のxの使用がxと呼ばれるメソッドパラメータに言及したものと仮定します。

source: Without the extension to explicitly declare conditional conformance to Loggable, the other Array extensions would implicitly create these declarations, resulting in an error:
ja: 拡張がLoggableへの条件準拠を明示的に宣言することなしには、他のArray拡張は、結果としてエラーになるこれら宣言を暗黙的に作成するでしょう。

source: Without this conversion in place, the addition would not be allowed.
ja: 適切なこの変換なしでは、この加算は許されません。

source: Without this requirement, Dictionary could not tell whether it should insert or replace a value for a particular key, nor would it be able to find a value for a given key that is already in the dictionary.
ja: この要件なしでは、Dictionaryはそれが特定のキーのために値を差し込んだり取り替えたりするべきかどうか伝えることができませんし、それはすでに辞書の中にある指定されたキーに対する値を見つけることもできません。

source: Without this type alias, the sum function would have to refer to the associated type as T.Iterator.Element instead of T.Element.
ja: この型エイリアスな時では、sum関数は関連値をT.Iterator.Elementのように参照しなければならないでしょう、T.Elementではなく。

source: Working back down from the top of the chain, each designated initializer in the chain has the option to customize the instance further.
ja: 連鎖の最上部から逆に階層を下って、連鎖の中の各指定イニシャライザは、さらにインスタンスを好みに合わせて作り変える選択肢を持ちます。

source: Working with Characters
ja: 文字を扱う

source: Wrap the name in parentheses and escape it with a backslash before the opening parenthesis:
ja: 丸括弧にその名前を包んで、始めの括弧の前のバックスラッシュでそれをエスケープします：

source: Wrapper types like JoinedShape and FlippedShape don’t matter to the module’s users, and they shouldn’t be visible.
ja: JoinedShapeとFlippedShapeのようなラッパー型は、モジュールのユーザにとって重要ではありません、そしてそれらは可視でないべきです。

source: Write a custom argument label before the parameter name, or write _ to use no argument label.
ja: あつらえの引数ラベルはパラメータ名の前に書いてください、または引数ラベルなしで使うためには_を書いてください。

source: Write a function that compares two Rank values by comparing their raw values.
ja: それらの生の値を比較することによって２つのRankの値を比較する関数を記述してください。

source: Write a function that returns an array containing a full deck of cards, with one card of each combination of rank and suit.
ja: ランク（順位）とスート（記号）の各組合せのカード１枚を持つ、カードの完全なデック（一組）を含んでいる配列を返す関数を書いてください。

source: Write a name inside angle brackets to make a generic function or type.
ja: 総称体である関数や型を作るためには、その名前を山形括弧の中に書いてください。

source: Write a question mark (?) after the type of a value to mark the value as optional.
ja: ある値がオプショナルであると印するために、その値の型の後に疑問符（?）を書いてください。

source: Write a type annotation by placing a colon after the constant or variable name, followed by a space, followed by the name of the type to use.
ja: 定数か変数の名前のあとにコロンを置いて、１つの空白に続き、使用する型の名前を続けることによって型注釈を書いてください。

source: Write an extension for the Double type that adds an absoluteValue property.
ja: Double型のために拡張をひとつ書いてください、それはabsoluteValueプロパティを加えるものです。

source: Write an optional binding for an if statement as follows:
ja: オプショナルの束縛をif文のために次のように書いてください：

source: Write an underscore (_) for an argument with no name.
ja: 名前のない引数に対しては１つのアンダースコア（_）を書いてください。

source: Write the required modifier before the definition of a class initializer to indicate that every subclass of the class must implement that initializer:
ja: required修飾子をクラス・イニシャライザの定義の前に書いて、そのクラスの全てのサブクラスがそのイニシャライザを実装しなければならないことを示してください：

source: Write these constraints after the name of the protocol you’re adopting by writing a generic where clause.
ja: それらの制約を、あなたが総称体where節を書くことによって採用しているプロトコルの名前の後に書いてください。

source: Write variadic parameters by inserting three period characters (...) after the parameter’s type name.
ja: そのパラメータの型名の後に３つのピリオド文字（...）を書き入れることによって、可変長パラメータを書いてください。

source: Write your code using the model given by copy-in copy-out, without depending on the call-by-reference optimization, so that it behaves correctly with or without the optimization.
ja: あなたのコードをコピーイン・コピーアウトによって与えられるモデルを使って書いてください、参照呼び出し最適化に依存することなしに、そうすることでそれは最適化があってもなくても正しく振舞います。

source: Writing <T: Equatable> is the same as writing <T> ... where T: Equatable.
ja: <T: Equatable>と書くことは、<T> ... where T: Equatableと書くことと同じです。

source: Writing someStructure.$someNumber accesses the wrapper’s projected value.
ja: someStructure.$someNumberを書くことは、ラッパーのもつ予測値にアクセスします。

source: Writing Self.someStaticMember to access a member of the current type is the same as writing type(of: self).someStaticMember.
ja: Self.someStaticMemberを書いて現在の型のあるメンバーにアクセスすることは、type(of: self).someStaticMemberを書くことと同じです。

source: Writing makeTrapezoid() this way lets it express the fundamental aspect of its public interface—the value it returns is a shape—without making the specific types that the shape is made from a part of its public interface.
ja: makeTrapezoid()をこの方法で書くことは、それにそれのパブリックインターフェイスの基本となる面 — それが返す値はある形状である — を表現させます、特定の型を作ることなしにです、それはその形状がそれのパブリックインターフェイスの一部に由来して作られることです。

source: Writing Swift code in a playground lets you experiment with code and see the results immediately, without the overhead of building and running an app.
ja: スウィフトコードをあるプレイグラウンドの中で書くことで、あなたはコードで実験しその結果を直ちに確かめます、アプリをビルドして実行する手間なしにです。

source: You can iterate over a one-sided range that omits its final value; however, because the range continues indefinitely, make sure you add an explicit end condition for the loop.
ja: あなたは、それの最後の値を省いた片側範囲に対して反復処理できます；しかしながら、範囲があいまいに続いていることから、確実にあなたが明示的な終了条件をそのループに対して加えるようにしてください。

source: You access and modify a dictionary through its methods and properties, or by using subscript syntax.
ja: あなたは、辞書へのアクセスおよび修正をそれのメソッドとプロパティを通して、または添え字構文を使うことで行います。

source: You access and modify a set through its methods and properties.
ja: あなたは集合へのアクセス及び変更をそれのメソッドとプロパティを通して行います。

source: You access and modify a string through its methods and properties, or by using subscript syntax.
ja: あなたは文字列へのアクセスと修正を、それのメソッドとプロパティを通して、または添え字構文を使うことによって行います。

source: You access and modify an array through its methods and properties, or by using subscript syntax.
ja: あなたは、そのメソッドとプロパティを通して、または添え字構文を使うことによって、配列にアクセスして修正します。

source: You access the indices before and after a given index using the index(before:) and index(after:) methods of String.
ja: あなたは、ある与えられたインデックスの前後のインデックスにStringのindex(before:)とindex(after:)メソッドを使ってアクセスします。

source: You access the raw value of an enumeration case with its rawValue property:
ja: ある列挙ケース節の生の値にそれのrawValueプロパティでアクセスしてください：

source: You add conditional conformance to a protocol by including requirements in an extension declaration.
ja: あなたは、あるプロトコルに対する条件準拠を加えることを、要件を拡張宣言に含めることによって行います。

source: You also cannot use the implicit self property, or call any of the instance’s methods.
ja: あなたはまた、暗黙のselfプロパティを使うことや、そのインスタンスのメソッドの何も呼ぶことができません。

source: You also can’t use it as constraint in a generic return type because there isn’t enough information outside the function body to infer what the generic type needs to be.
ja: あなたはまたそれを制約として総称体戻り型において使用できません、なぜならどうあることをその総称体型が必要とするか推論するのに十分な情報が関数本文の外側にないからです。

source: You also don’t need to write semicolons at the end of every statement.
ja: あなたはまた、すべての文の終わりにセミコロンを書く必要がありません。

source: You also saw how to use weak and unowned references to break these strong reference cycles.
ja: あなたはまた、これらの強い参照循環を壊すために弱いおよび非所有参照を使う方法を見ました。

source: You also use an initializer expression to delegate to the initializer of a superclass.
ja: あなたはまた、スーパークラスのイニシャライザに委任するために、イニシャライザ式を使います。

source: You always write the override modifier when overriding a superclass designated initializer, even if your subclass’s implementation of the initializer is a convenience initializer.
ja: あなたはスーパークラスの指定イニシャライザをオーバーライドする時に常にoverride修飾子を書きます、そのイニシャライザのあなたのサブクラスでの実装が便宜イニシャライザであるとしてもです。

source: You apply a wrapper to a property by writing the wrapper’s name before the property as an attribute.
ja: あなたは、ラッパーのもつ名前をそのプロパティの前に属性として書くことによって、ラッパーをプロパティに適用します。

source: You apply it to a parameter’s type in a method or function declaration, for a parameter whose type is a function type that takes no arguments and that returns a value of the type of the expression.
ja: あなたは、それをメソッドまたは関数宣言においてあるパラメータの持つ型に適用します、それの型もつが関数型であるパラメータに対して、それは引数を取らずそしてそれは式の型のひとつの値を返すものです。

source: You apply the IBOutlet and IBInspectable attributes to property declarations of a class.
ja: あなたは、IBOutletとIBInspectable属性をクラスのプロパティ宣言に適用します。

source: You apply the IBAction and IBSegueAction attribute to method declarations of a class and the IBDesignable attribute to class declarations.
ja: あなたは、IBActionとIBSegueAction属性をクラスのメソッド宣言に、そしてIBDesignable属性をクラス宣言に適用します。

source: You are free to implement subscripts in the most appropriate way for your particular class or structure’s functionality.
ja: あなたは、あなたの特定のクラスまたは構造体の機能性に最も適切な方法で、添え字を実装して結構です。

source: You are not allowed to call a deinitializer yourself.
ja: あなたは、デイニシャライザをあなた自身で呼び出すことは許されません。

source: You assign a lower access level by writing fileprivate(set), private(set), or internal(set) before the var or subscript introducer.
ja: あなたは、より低いアクセス水準を割り当てることを、fileprivate(set)、private(set)、またはinternal(set)をvarまたはsubscript導入子の前に書くことによって行います。

source: You call an init? failable initializer in the same way that you call a nonfailable initializer, except that you must deal with the optionality of the result.
ja: あなたは失敗できるイニシャライザinit?を、オプショナルの結果を処理する必要があることを除き、失敗できないイニシャライザを呼び出すのと同じ方法で呼び出します。

source: You call instance methods with the same dot syntax as properties:
ja: あなたは、インスタンスメソッドをプロパティと同じドット構文を使って呼び出します：

source: You call the greet(person:) function by passing it a String value after the person argument label, such as greet(person: "Anna").
ja: あなたは、greet(person:)関数をそれにString値をperson引数ラベルの後で渡すことによって、例えばgreet(person: "Anna")のように呼び出します。

source: You call the greet(person:alreadyGreeted:) function by passing it both a String argument value labeled person and a Bool argument value labeled alreadyGreeted in parentheses, separated by commas.
ja: あなたはgreet(person:alreadyGreeted:)関数をそれにpersonでラベルしたString引数値とalreadyGreetedでラベルしたBool引き数値を両方とも丸括弧内に、コンマで区切って渡すことで呼び出します。

source: You call the UINavigationController class pushViewController(_:animated:) method to add (or push) a view controller on to the navigation stack, and its popViewControllerAnimated(_:) method to remove (or pop) a view controller from the navigation stack.
ja: あなたはUINavigationControllerクラスのpushViewController(_:animated:)メソッドをナビゲーション・スタックにビュー・コントローラを加える（またはプッシュする）ために、そしてそれのpopViewControllerAnimated(_:)メソッドをナビゲーション・スタックからビュー・コントローラを取り除くために呼びます。

source: You can decompose a tuple’s contents into separate constants or variables, which you then access as usual:
ja: あなたはタプルの内容を個々の定数または変数に分解することができます。そして、あなたはそれから通常通りそれにアクセスします：

source: You can access a UTF-16 representation of a String by iterating over its utf16 property.
ja: あなたは、あるStringのUTF-16叙述に、それのutf16プロパティのすべてに渡って繰り返していくことによってアクセスすることができます。

source: You can access a UTF-8 representation of a String by iterating over its utf8 property.
ja: あなたは、あるStringのUTF-８叙述に、それのutf8プロパティのすべてに渡って繰り返していくことによってアクセスすることができます。

source: You can access a Unicode scalar representation of a String value by iterating over its unicodeScalars property.
ja: あなたは、あるStringのUnicodeスカラー叙述に、それのunicodeScalarsプロパティのすべてに渡って繰り返していくことによってアクセスすることができます。

source: You can access the individual Character values for a String by iterating over the string with a for-in loop:
ja: あなたは、あるStringの個々のCharacter値にfor-inループでその文字列の初めから終わりまで反復することによってアクセスできます：
